-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Май 23 2026 г., 12:39
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `secure_docflow`
--

-- --------------------------------------------------------

--
-- Структура таблицы `documents`
--

CREATE TABLE `documents` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `file_name` varchar(255) NOT NULL,
  `encrypted_file_name` varchar(255) DEFAULT NULL,
  `file_hash` varchar(255) DEFAULT NULL,
  `uploaded_by` int(11) DEFAULT NULL,
  `receiver_id` int(11) DEFAULT NULL,
  `status` varchar(50) DEFAULT 'Не подписан',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `signed_by` int(11) DEFAULT NULL,
  `signed_at` timestamp NULL DEFAULT NULL,
  `signature_hash` varchar(255) DEFAULT NULL,
  `correction_of` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `documents`
--

INSERT INTO `documents` (`id`, `title`, `file_name`, `encrypted_file_name`, `file_hash`, `uploaded_by`, `receiver_id`, `status`, `created_at`, `signed_by`, `signed_at`, `signature_hash`, `correction_of`) VALUES
(5, 'Тест', 'test.pdf', '1779210942780-test.pdf', '81d1fd6cf1291f26956c551d41a8a97ed226a1074fd9f25ed75b3857bdb4c010', 1, NULL, 'Не подписан', '2026-05-19 17:15:43', 1, '2026-05-19 17:31:04', '81d1fd6cf1291f26956c551d41a8a97ed226a1074fd9f25ed75b3857bdb4c010', NULL),
(8, 'Документ', 'Отчет_Куликалов.docx', '1779214238335-ÐÑÑÐµÑ_ÐÑÐ»Ð¸ÐºÐ°Ð»Ð¾Ð².docx', '5761d98e5a153fcaf9c91d63d91007e3cc05e44ceffc3eefa093b9340e25d35f', 1, NULL, 'Не подписан', '2026-05-19 18:10:38', 1, '2026-05-20 06:50:16', '5761d98e5a153fcaf9c91d63d91007e3cc05e44ceffc3eefa093b9340e25d35f', NULL),
(10, 'Отчет2', 'Отчет_Практика_Останина.docx', '1779260805734-ÐÑÑÐµÑ_ÐÑÐ°ÐºÑÐ¸ÐºÐ°_ÐÑÑÐ°Ð½Ð¸Ð½Ð°.docx', 'e593562283540f9e45a9878bcffadeb3ac23a020c4fa0865330041e4eaad066a', 1, NULL, 'Не подписан', '2026-05-20 07:06:45', NULL, NULL, NULL, NULL),
(11, 'Тест_документ', 'Пробный_документ.docx', '1779261251598-ÐÑÐ¾Ð±Ð½ÑÐ¹_Ð´Ð¾ÐºÑÐ¼ÐµÐ½Ñ.docx', 'bb2796eaea95873f59816a6b2225b16d0461bf69abb21a9264739590f07dca5e', 10, NULL, 'Не подписан', '2026-05-20 07:14:11', NULL, NULL, NULL, NULL),
(12, 'Документ1', 'Отчет ПП_04.docx', '1779262517673-ÐÑÑÐµÑ ÐÐ_04.docx', '09053e205739761e3bffd2a087c09e9ffc0ea7665602654a2532d0cce3471ba1', 9, NULL, 'Не подписан', '2026-05-20 07:35:17', NULL, NULL, NULL, NULL),
(13, 'Отчет', 'Отчет_титульник_Останина.docx', '1779262527355-ÐÑÑÐµÑ_ÑÐ¸ÑÑÐ»ÑÐ½Ð¸Ðº_ÐÑÑÐ°Ð½Ð¸Ð½Ð°.docx', '7cd448381c1200263d9c8125ed1005739bcaf91c2de82f87ebcc74e127d623ed', 9, NULL, 'Не подписан', '2026-05-20 07:35:27', 10, '2026-05-20 07:39:15', '7cd448381c1200263d9c8125ed1005739bcaf91c2de82f87ebcc74e127d623ed', NULL),
(14, 'Аттестационный лист', 'Аттестационный лист ИСП_Останина.docx', '1779262548409-ÐÑÑÐµÑÑÐ°ÑÐ¸Ð¾Ð½Ð½ÑÐ¸Ì Ð»Ð¸ÑÑ ÐÐ¡Ð_ÐÑÑÐ°Ð½Ð¸Ð½Ð°.docx', '1f7d044b687d26eb7a83682fb87ae72da0a0ba364358aa7408a3e093d53729fd', 9, NULL, 'Не подписан', '2026-05-20 07:35:48', 10, '2026-05-20 07:39:31', '1f7d044b687d26eb7a83682fb87ae72da0a0ba364358aa7408a3e093d53729fd', NULL),
(15, 'Отправка', 'печать.docx', '1779472415025-Ð¿ÐµÑÐ°ÑÑ.docx', '4783a22abe78d4aac766ab749140f9cc80504badb84e8830575c3708b02329e2', 1, NULL, 'Подписан ЭЦП', '2026-05-22 17:53:35', 1, '2026-05-22 17:53:45', '4783a22abe78d4aac766ab749140f9cc80504badb84e8830575c3708b02329e2', NULL),
(16, 'Исправление к документу: Отправка', 'печать.docx', '1779472527317-Ð¿ÐµÑÐ°ÑÑ.docx', '4783a22abe78d4aac766ab749140f9cc80504badb84e8830575c3708b02329e2', 1, NULL, 'Подписан ЭЦП', '2026-05-22 17:55:27', 9, '2026-05-22 17:56:41', '4783a22abe78d4aac766ab749140f9cc80504badb84e8830575c3708b02329e2', 15),
(17, 'Тест_документ', 'Пробный_документ.docx', '1779527835812-ÐÑÐ¾Ð±Ð½ÑÐ¹_Ð´Ð¾ÐºÑÐ¼ÐµÐ½Ñ.docx', 'bb2796eaea95873f59816a6b2225b16d0461bf69abb21a9264739590f07dca5e', 1, NULL, 'В работе', '2026-05-23 09:17:15', NULL, NULL, NULL, NULL),
(18, '123', 'Пробный_документ.docx', '1779529119948-ÐÑÐ¾Ð±Ð½ÑÐ¹_Ð´Ð¾ÐºÑÐ¼ÐµÐ½Ñ.docx', 'bb2796eaea95873f59816a6b2225b16d0461bf69abb21a9264739590f07dca5e', 9, NULL, 'В работе', '2026-05-23 09:38:39', NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `document_recipients`
--

CREATE TABLE `document_recipients` (
  `id` int(11) NOT NULL,
  `document_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `document_recipients`
--

INSERT INTO `document_recipients` (`id`, `document_id`, `user_id`, `created_at`) VALUES
(1, 15, 10, '2026-05-22 17:53:35'),
(2, 15, 6, '2026-05-22 17:53:35'),
(3, 15, 2, '2026-05-22 17:53:35'),
(4, 15, 9, '2026-05-22 17:53:35'),
(5, 16, 9, '2026-05-22 17:55:27'),
(6, 17, 10, '2026-05-23 09:17:15'),
(7, 17, 6, '2026-05-23 09:17:15'),
(8, 17, 9, '2026-05-23 09:17:15'),
(9, 18, 6, '2026-05-23 09:38:39'),
(10, 18, 8, '2026-05-23 09:38:39');

-- --------------------------------------------------------

--
-- Структура таблицы `logs`
--

CREATE TABLE `logs` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `action` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `logs`
--

INSERT INTO `logs` (`id`, `user_id`, `action`, `created_at`) VALUES
(1, 1, 'Вход в систему', '2026-05-19 12:33:00'),
(2, 1, 'Загрузка документа: Документ 1', '2026-05-19 13:05:33'),
(3, 1, 'Просмотр списка документов', '2026-05-19 13:16:42'),
(4, 1, 'Просмотр списка документов', '2026-05-19 13:17:40'),
(5, 1, 'Удаление документа: Документ 1', '2026-05-19 13:23:34'),
(6, 1, 'Загрузка и шифрование документа: Зашифрованный документ', '2026-05-19 13:31:44'),
(7, 1, 'Скачивание документа: Зашифрованный документ', '2026-05-19 13:39:27'),
(8, 2, 'Регистрация пользователя', '2026-05-19 13:46:25'),
(9, 2, 'Вход в систему', '2026-05-19 13:47:54'),
(10, 2, 'Просмотр списка документов', '2026-05-19 13:51:38'),
(11, 2, 'Попытка удаления чужого документа: Зашифрованный документ', '2026-05-19 13:54:45'),
(12, 2, 'Попытка скачивания чужого документа: Зашифрованный документ', '2026-05-19 13:57:42'),
(13, 2, 'Попытка проверки чужого документа: Зашифрованный документ', '2026-05-19 14:13:26'),
(14, 1, 'Проверка целостности документа: Зашифрованный документ', '2026-05-19 14:13:44'),
(15, 1, 'Подписание документа: Зашифрованный документ', '2026-05-19 14:25:34'),
(16, 1, 'Проверка подписи документа: Зашифрованный документ', '2026-05-19 14:26:16'),
(17, 1, 'Вход в систему', '2026-05-19 14:43:49'),
(18, 1, 'Вход в систему', '2026-05-19 14:43:55'),
(19, 1, 'Вход в систему', '2026-05-19 14:48:32'),
(20, 1, 'Вход в систему', '2026-05-19 14:48:35'),
(21, 1, 'Неудачная попытка входа', '2026-05-19 14:56:05'),
(22, 1, 'Вход в систему', '2026-05-19 15:00:41'),
(23, 1, 'Просмотр списка документов', '2026-05-19 15:05:40'),
(24, 1, 'Просмотр списка документов', '2026-05-19 15:05:43'),
(25, 1, 'Просмотр списка документов', '2026-05-19 15:08:33'),
(26, 1, 'Просмотр списка документов', '2026-05-19 15:08:35'),
(27, 1, 'Просмотр списка документов', '2026-05-19 15:10:57'),
(28, 1, 'Загрузка и шифрование документа: Титульник_Отчет', '2026-05-19 15:11:35'),
(29, 1, 'Просмотр списка документов', '2026-05-19 15:11:37'),
(30, 1, 'Скачивание документа: Титульник_Отчет', '2026-05-19 15:11:47'),
(31, 1, 'Подписание документа: Титульник_Отчет', '2026-05-19 15:12:01'),
(32, 1, 'Просмотр списка документов', '2026-05-19 15:12:03'),
(33, 1, 'Проверка подписи документа: Титульник_Отчет', '2026-05-19 15:12:04'),
(34, 1, 'Удаление документа: Титульник_Отчет', '2026-05-19 15:12:22'),
(35, 1, 'Просмотр списка документов', '2026-05-19 15:12:23'),
(36, 1, 'Просмотр списка документов', '2026-05-19 15:20:02'),
(37, 1, 'Вход в систему', '2026-05-19 15:21:18'),
(38, 1, 'Просмотр списка документов', '2026-05-19 15:21:18'),
(39, 1, 'Проверка подписи документа: Зашифрованный документ', '2026-05-19 15:21:32'),
(40, 1, 'Скачивание документа: Зашифрованный документ', '2026-05-19 15:21:38'),
(41, 2, 'Вход в систему', '2026-05-19 15:22:47'),
(42, 2, 'Просмотр списка документов', '2026-05-19 15:22:47'),
(43, 2, 'Просмотр списка документов', '2026-05-19 15:22:56'),
(44, 2, 'Просмотр списка документов', '2026-05-19 15:22:58'),
(45, NULL, 'Неудачная попытка входа', '2026-05-19 15:36:18'),
(46, NULL, 'Неудачная попытка входа', '2026-05-19 15:36:22'),
(47, NULL, 'Неудачная попытка входа', '2026-05-19 15:36:40'),
(48, 6, 'Регистрация пользователя', '2026-05-19 15:37:51'),
(49, 7, 'Регистрация пользователя', '2026-05-19 15:38:15'),
(50, 8, 'Регистрация пользователя', '2026-05-19 15:38:33'),
(51, 6, 'Вход в систему', '2026-05-19 15:38:38'),
(52, 6, 'Просмотр списка документов', '2026-05-19 15:38:41'),
(53, 6, 'Загрузка и шифрование документа: Печать', '2026-05-19 15:39:48'),
(54, 6, 'Просмотр списка документов', '2026-05-19 15:39:49'),
(55, 6, 'Просмотр списка документов', '2026-05-19 15:39:55'),
(56, 8, 'Вход в систему', '2026-05-19 15:40:28'),
(57, 8, 'Просмотр списка документов', '2026-05-19 15:40:28'),
(58, 8, 'Просмотр списка документов', '2026-05-19 15:43:30'),
(59, 6, 'Неудачная попытка входа', '2026-05-19 15:45:19'),
(60, 6, 'Вход в систему', '2026-05-19 15:45:26'),
(61, 6, 'Просмотр списка документов', '2026-05-19 15:45:26'),
(62, 6, 'Подписание документа: Печать', '2026-05-19 15:45:37'),
(63, 6, 'Просмотр списка документов', '2026-05-19 15:45:39'),
(64, 6, 'Проверка подписи документа: Печать', '2026-05-19 15:45:39'),
(65, 6, 'Скачивание документа: Печать', '2026-05-19 15:45:43'),
(66, 6, 'Просмотр списка документов', '2026-05-19 15:51:29'),
(67, 1, 'Вход в систему', '2026-05-19 15:51:46'),
(68, 1, 'Просмотр списка документов', '2026-05-19 15:51:46'),
(69, 8, 'Просмотр списка документов', '2026-05-19 15:51:59'),
(70, 1, 'Вход в систему', '2026-05-19 15:52:15'),
(71, 1, 'Просмотр списка документов', '2026-05-19 15:52:15'),
(72, 9, 'Регистрация пользователя', '2026-05-19 15:53:01'),
(73, 1, 'Просмотр списка документов', '2026-05-19 15:59:12'),
(74, 1, 'Просмотр списка документов', '2026-05-19 15:59:14'),
(75, 1, 'Просмотр списка документов', '2026-05-19 15:59:16'),
(76, 1, 'Просмотр списка документов', '2026-05-19 15:59:16'),
(77, 1, 'Просмотр списка документов', '2026-05-19 15:59:17'),
(78, 1, 'Просмотр списка документов', '2026-05-19 15:59:18'),
(79, 1, 'Просмотр списка документов', '2026-05-19 15:59:19'),
(80, 1, 'Просмотр списка документов', '2026-05-19 15:59:20'),
(81, 1, 'Просмотр списка документов', '2026-05-19 15:59:32'),
(82, 1, 'Просмотр списка документов', '2026-05-19 15:59:39'),
(83, 1, 'Просмотр списка документов', '2026-05-19 15:59:40'),
(84, 1, 'Просмотр списка документов', '2026-05-19 15:59:41'),
(85, 1, 'Просмотр списка документов', '2026-05-19 15:59:41'),
(86, 1, 'Просмотр списка документов', '2026-05-19 15:59:42'),
(87, 1, 'Просмотр списка документов', '2026-05-19 15:59:42'),
(88, 1, 'Просмотр списка документов', '2026-05-19 15:59:42'),
(89, 1, 'Просмотр списка документов', '2026-05-19 15:59:43'),
(90, 1, 'Просмотр списка документов', '2026-05-19 15:59:43'),
(91, 1, 'Просмотр списка документов', '2026-05-19 15:59:43'),
(92, 1, 'Просмотр списка документов', '2026-05-19 15:59:43'),
(93, 1, 'Просмотр списка документов', '2026-05-19 15:59:43'),
(94, 1, 'Просмотр списка документов', '2026-05-19 15:59:44'),
(95, 1, 'Просмотр списка документов', '2026-05-19 15:59:44'),
(96, 1, 'Просмотр списка документов', '2026-05-19 15:59:45'),
(97, 1, 'Просмотр списка документов', '2026-05-19 15:59:48'),
(98, 1, 'Просмотр списка документов', '2026-05-19 15:59:56'),
(99, 1, 'Просмотр списка документов', '2026-05-19 15:59:57'),
(100, 1, 'Просмотр списка документов', '2026-05-19 16:00:02'),
(101, 1, 'Просмотр списка документов', '2026-05-19 16:41:28'),
(102, 1, 'Подписание документа: Печать', '2026-05-19 16:41:42'),
(103, 1, 'Просмотр списка документов', '2026-05-19 16:41:43'),
(104, 1, 'Проверка подписи документа: Печать', '2026-05-19 16:41:44'),
(105, 1, 'Скачивание документа: Печать', '2026-05-19 16:41:57'),
(106, 1, 'Подписание документа: Зашифрованный документ', '2026-05-19 16:42:23'),
(107, 1, 'Просмотр списка документов', '2026-05-19 16:42:27'),
(108, 1, 'Проверка подписи документа: Печать', '2026-05-19 16:42:35'),
(109, 1, 'Подписание документа: Печать', '2026-05-19 16:42:57'),
(110, 1, 'Просмотр списка документов', '2026-05-19 16:43:03'),
(111, 1, 'Скачивание документа: Печать', '2026-05-19 16:43:04'),
(112, 1, 'Просмотр списка документов', '2026-05-19 17:14:45'),
(113, 1, 'Подписание документа: Печать', '2026-05-19 17:14:54'),
(114, 1, 'Просмотр списка документов', '2026-05-19 17:14:56'),
(115, 1, 'Проверка подписи документа: Печать', '2026-05-19 17:14:57'),
(116, 1, 'Просмотр документа с электронной печатью: Печать', '2026-05-19 17:14:59'),
(117, 1, 'Загрузка и шифрование документа: Тест', '2026-05-19 17:15:43'),
(118, 1, 'Просмотр списка документов', '2026-05-19 17:15:45'),
(119, 1, 'Просмотр списка документов', '2026-05-19 17:15:51'),
(120, 1, 'Просмотр списка документов', '2026-05-19 17:16:54'),
(121, 1, 'Подписание документа: Тест', '2026-05-19 17:16:57'),
(122, 1, 'Просмотр списка документов', '2026-05-19 17:16:57'),
(123, 1, 'Просмотр документа с электронной печатью: Тест', '2026-05-19 17:16:58'),
(124, 1, 'Вход в систему', '2026-05-19 17:21:06'),
(125, 1, 'Просмотр списка документов', '2026-05-19 17:21:06'),
(126, 1, 'Вход в систему', '2026-05-19 17:21:38'),
(127, 1, 'Просмотр списка документов', '2026-05-19 17:21:38'),
(128, 1, 'Просмотр списка документов', '2026-05-19 17:21:50'),
(129, 1, 'Просмотр списка документов', '2026-05-19 17:21:56'),
(130, 1, 'Просмотр списка документов', '2026-05-19 17:26:21'),
(131, 1, 'Просмотр списка документов', '2026-05-19 17:26:32'),
(132, 1, 'Просмотр списка документов', '2026-05-19 17:26:33'),
(133, 1, 'Просмотр списка документов', '2026-05-19 17:26:36'),
(134, 1, 'Просмотр списка документов', '2026-05-19 17:27:01'),
(135, 1, 'Просмотр списка документов', '2026-05-19 17:27:12'),
(136, 1, 'Просмотр списка документов', '2026-05-19 17:30:53'),
(137, 1, 'Скачивание документа: Тест', '2026-05-19 17:30:57'),
(138, 1, 'Подписание документа: Тест', '2026-05-19 17:31:04'),
(139, 1, 'Просмотр списка документов', '2026-05-19 17:31:06'),
(140, 1, 'Просмотр документа с электронной печатью: Тест', '2026-05-19 17:31:07'),
(141, 1, 'Удаление документа: Зашифрованный документ', '2026-05-19 17:31:23'),
(142, 1, 'Просмотр списка документов', '2026-05-19 17:31:24'),
(143, 10, 'Регистрация пользователя', '2026-05-19 17:32:01'),
(144, 10, 'Вход в систему', '2026-05-19 17:32:11'),
(145, 10, 'Просмотр списка документов', '2026-05-19 17:32:11'),
(146, 6, 'Вход в систему', '2026-05-19 17:32:36'),
(147, 6, 'Просмотр списка документов', '2026-05-19 17:32:36'),
(148, 6, 'Подписание документа: Печать', '2026-05-19 17:32:45'),
(149, 6, 'Просмотр списка документов', '2026-05-19 17:32:46'),
(150, 6, 'Просмотр документа с электронной печатью: Печать', '2026-05-19 17:32:47'),
(151, 1, 'Вход в систему', '2026-05-19 17:33:13'),
(152, 1, 'Просмотр списка документов', '2026-05-19 17:33:13'),
(153, 1, 'Просмотр списка документов', '2026-05-19 17:41:18'),
(154, 1, 'Просмотр списка документов', '2026-05-19 17:41:21'),
(155, 1, 'Просмотр списка документов', '2026-05-19 17:52:43'),
(156, 1, 'Редактирование пользователя с ID: 10', '2026-05-19 17:52:56'),
(157, 1, 'Просмотр списка документов', '2026-05-19 17:53:00'),
(158, 1, 'Просмотр списка документов', '2026-05-19 17:53:12'),
(159, 1, 'Просмотр списка документов', '2026-05-19 17:53:13'),
(160, 1, 'Просмотр списка документов', '2026-05-19 17:53:20'),
(161, 1, 'Просмотр списка документов', '2026-05-19 17:53:27'),
(162, 1, 'Просмотр списка документов', '2026-05-19 17:53:36'),
(163, 1, 'Редактирование пользователя с ID: 10', '2026-05-19 17:53:48'),
(164, 1, 'Вход в систему', '2026-05-19 17:54:02'),
(165, 1, 'Просмотр списка документов', '2026-05-19 17:54:02'),
(166, 1, 'Просмотр списка документов', '2026-05-19 17:54:19'),
(167, 1, 'Загрузка и шифрование документа: Документ', '2026-05-19 17:54:28'),
(168, 1, 'Просмотр списка документов', '2026-05-19 17:54:30'),
(169, 1, 'Подписание документа: Документ', '2026-05-19 17:54:35'),
(170, 1, 'Просмотр списка документов', '2026-05-19 17:54:37'),
(171, 1, 'Просмотр документа с электронной печатью: Документ', '2026-05-19 17:54:38'),
(172, 1, 'Скачивание документа: Документ', '2026-05-19 17:54:55'),
(173, 1, 'Удаление документа: Документ', '2026-05-19 17:55:10'),
(174, 1, 'Просмотр списка документов', '2026-05-19 17:55:11'),
(175, 6, 'Вход в систему', '2026-05-19 17:55:47'),
(176, 6, 'Просмотр списка документов', '2026-05-19 17:55:47'),
(177, 1, 'Вход в систему', '2026-05-19 17:58:40'),
(178, 1, 'Просмотр списка документов', '2026-05-19 17:58:45'),
(179, 9, 'Вход в систему', '2026-05-19 17:59:11'),
(180, 9, 'Просмотр списка документов', '2026-05-19 17:59:11'),
(181, 9, 'Загрузка и шифрование документа: Документ', '2026-05-19 17:59:22'),
(182, 9, 'Просмотр списка документов', '2026-05-19 17:59:23'),
(183, 1, 'Вход в систему', '2026-05-19 17:59:26'),
(184, 1, 'Просмотр списка документов', '2026-05-19 17:59:26'),
(185, 1, 'Просмотр списка документов', '2026-05-19 18:06:22'),
(186, 9, 'Вход в систему', '2026-05-19 18:06:48'),
(187, 9, 'Просмотр списка документов', '2026-05-19 18:06:49'),
(188, 9, 'Скачивание документа: Документ', '2026-05-19 18:06:59'),
(189, 1, 'Вход в систему', '2026-05-19 18:07:11'),
(190, 1, 'Просмотр списка документов', '2026-05-19 18:07:11'),
(191, 1, 'Просмотр списка документов', '2026-05-19 18:07:22'),
(192, 1, 'Скачивание документа: Документ', '2026-05-19 18:07:23'),
(193, 1, 'Скачивание документа: Печать', '2026-05-19 18:07:32'),
(194, 1, 'Просмотр списка документов', '2026-05-19 18:10:10'),
(195, 1, 'Удаление документа: Документ', '2026-05-19 18:10:11'),
(196, 1, 'Просмотр списка документов', '2026-05-19 18:10:12'),
(197, 1, 'Скачивание документа: Тест', '2026-05-19 18:10:14'),
(198, 1, 'Скачивание документа: Печать', '2026-05-19 18:10:15'),
(199, 1, 'Удаление документа: Печать', '2026-05-19 18:10:23'),
(200, 1, 'Просмотр списка документов', '2026-05-19 18:10:24'),
(201, 1, 'Загрузка и шифрование документа: Документ', '2026-05-19 18:10:38'),
(202, 1, 'Просмотр списка документов', '2026-05-19 18:10:39'),
(203, 1, 'Скачивание документа: Документ', '2026-05-19 18:10:41'),
(204, 1, 'Вход в систему', '2026-05-19 18:25:09'),
(205, 1, 'Просмотр списка документов', '2026-05-19 18:25:09'),
(206, 1, 'Вход в систему', '2026-05-19 18:26:43'),
(207, 1, 'Просмотр списка документов', '2026-05-19 18:26:43'),
(208, 1, 'Просмотр списка документов', '2026-05-19 18:27:09'),
(209, 1, 'Просмотр списка документов', '2026-05-19 18:27:10'),
(210, 1, 'Вход в систему', '2026-05-19 18:31:46'),
(211, 1, 'Вход в систему', '2026-05-19 18:38:34'),
(212, 1, 'Просмотр списка документов', '2026-05-19 18:38:34'),
(213, 1, 'Просмотр списка документов', '2026-05-19 18:38:49'),
(214, 1, 'Вход в систему', '2026-05-20 06:49:13'),
(215, 1, 'Просмотр списка документов', '2026-05-20 06:49:14'),
(216, 1, 'Просмотр списка документов', '2026-05-20 06:50:12'),
(217, 1, 'Просмотр списка документов', '2026-05-20 06:50:15'),
(218, 1, 'Подписание документа: Документ', '2026-05-20 06:50:16'),
(219, 1, 'Просмотр списка документов', '2026-05-20 06:50:17'),
(220, 1, 'Просмотр документа с электронной печатью: Тест', '2026-05-20 06:50:31'),
(221, 1, 'Вход в систему', '2026-05-20 06:50:39'),
(222, 1, 'Просмотр списка документов', '2026-05-20 06:50:39'),
(223, 1, 'Загрузка и шифрование документа: Отчет', '2026-05-20 06:51:16'),
(224, 1, 'Просмотр списка документов', '2026-05-20 06:51:17'),
(225, 1, 'Скачивание документа: Отчет', '2026-05-20 06:51:19'),
(226, 1, 'Подписание документа: Отчет', '2026-05-20 06:51:26'),
(227, 1, 'Просмотр списка документов', '2026-05-20 06:51:27'),
(228, 1, 'Просмотр списка документов', '2026-05-20 06:53:26'),
(229, 1, 'Просмотр списка документов', '2026-05-20 06:53:28'),
(230, 1, 'Просмотр списка документов', '2026-05-20 06:53:33'),
(231, 1, 'Вход в систему', '2026-05-20 06:54:11'),
(232, 1, 'Просмотр списка документов', '2026-05-20 06:54:11'),
(233, 1, 'Подписание документа: Отчет', '2026-05-20 06:54:17'),
(234, 1, 'Просмотр списка документов', '2026-05-20 06:54:18'),
(235, 1, 'Подписание документа: Отчет', '2026-05-20 06:54:28'),
(236, 1, 'Просмотр списка документов', '2026-05-20 06:54:29'),
(237, 1, 'Вход в систему', '2026-05-20 07:00:49'),
(238, 1, 'Просмотр списка документов', '2026-05-20 07:00:49'),
(239, 1, 'Подписание документа: Отчет', '2026-05-20 07:01:01'),
(240, 1, 'Просмотр списка документов', '2026-05-20 07:01:02'),
(241, 1, 'Просмотр списка документов', '2026-05-20 07:05:04'),
(242, 1, 'Просмотр документа с электронной печатью: Отчет', '2026-05-20 07:05:05'),
(243, 1, 'Просмотр документа с электронной печатью: Документ', '2026-05-20 07:05:09'),
(244, 1, 'Скачивание документа: Отчет', '2026-05-20 07:05:25'),
(245, 1, 'Загрузка и шифрование документа: Отчет2', '2026-05-20 07:06:45'),
(246, 1, 'Просмотр списка документов', '2026-05-20 07:06:49'),
(247, 1, 'Скачивание документа: Отчет2', '2026-05-20 07:07:27'),
(248, 1, 'Вход в систему', '2026-05-20 07:09:59'),
(249, 1, 'Просмотр списка документов', '2026-05-20 07:09:59'),
(250, 10, 'Вход в систему', '2026-05-20 07:10:24'),
(251, 10, 'Просмотр списка документов', '2026-05-20 07:10:24'),
(252, 10, 'Загрузка и шифрование документа: Тест_документ', '2026-05-20 07:14:11'),
(253, 10, 'Просмотр списка документов', '2026-05-20 07:14:20'),
(254, 10, 'Просмотр списка документов', '2026-05-20 07:19:05'),
(255, 10, 'Скачивание документа: Тест_документ', '2026-05-20 07:20:04'),
(256, 10, 'Просмотр списка документов', '2026-05-20 07:23:59'),
(257, 10, 'Подписание документа: Отчет', '2026-05-20 07:24:05'),
(258, 10, 'Просмотр списка документов', '2026-05-20 07:24:13'),
(259, 10, 'Просмотр документа с электронной печатью: Отчет', '2026-05-20 07:24:14'),
(260, 10, 'Удаление документа: Отчет', '2026-05-20 07:25:23'),
(261, 10, 'Просмотр списка документов', '2026-05-20 07:25:25'),
(262, 10, 'Просмотр списка документов', '2026-05-20 07:27:01'),
(263, NULL, 'Регистрация пользователя', '2026-05-20 07:29:40'),
(264, 10, 'Удаление пользователя с ID: 11', '2026-05-20 07:30:03'),
(265, 10, 'Просмотр списка документов', '2026-05-20 07:31:47'),
(266, 9, 'Неудачная попытка входа', '2026-05-20 07:33:46'),
(267, 9, 'Вход в систему', '2026-05-20 07:33:50'),
(268, 9, 'Просмотр списка документов', '2026-05-20 07:33:50'),
(269, 9, 'Загрузка и шифрование документа: Документ1', '2026-05-20 07:35:17'),
(270, 9, 'Просмотр списка документов', '2026-05-20 07:35:18'),
(271, 9, 'Загрузка и шифрование документа: Отчет', '2026-05-20 07:35:27'),
(272, 9, 'Просмотр списка документов', '2026-05-20 07:35:28'),
(273, 9, 'Загрузка и шифрование документа: Аттестационный лист', '2026-05-20 07:35:48'),
(274, 9, 'Просмотр списка документов', '2026-05-20 07:35:49'),
(275, 9, 'Подписание документа: Аттестационный лист', '2026-05-20 07:35:59'),
(276, 9, 'Просмотр списка документов', '2026-05-20 07:36:04'),
(277, 9, 'Просмотр документа с электронной печатью: Аттестационный лист', '2026-05-20 07:36:42'),
(278, 10, 'Вход в систему', '2026-05-20 07:37:45'),
(279, 10, 'Просмотр списка документов', '2026-05-20 07:37:45'),
(280, 10, 'Просмотр документа с электронной печатью: Аттестационный лист', '2026-05-20 07:38:36'),
(281, 10, 'Подписание документа: Отчет', '2026-05-20 07:39:15'),
(282, 10, 'Просмотр списка документов', '2026-05-20 07:39:16'),
(283, 10, 'Просмотр документа с электронной печатью: Отчет', '2026-05-20 07:39:17'),
(284, 10, 'Подписание документа: Аттестационный лист', '2026-05-20 07:39:31'),
(285, 10, 'Просмотр списка документов', '2026-05-20 07:39:32'),
(286, 10, 'Просмотр документа с электронной печатью: Аттестационный лист', '2026-05-20 07:39:34'),
(287, 1, 'Вход в систему', '2026-05-22 17:48:21'),
(288, 1, 'Просмотр списка документов', '2026-05-22 17:48:21'),
(289, 1, 'Просмотр списка документов', '2026-05-22 17:48:27'),
(290, 1, 'Просмотр списка документов', '2026-05-22 17:48:35'),
(291, 1, 'Просмотр списка документов', '2026-05-22 17:52:51'),
(292, 1, 'Просмотр списка документов', '2026-05-22 17:52:54'),
(293, 1, 'Загрузка и шифрование документа: Отправка', '2026-05-22 17:53:35'),
(294, 1, 'Просмотр списка документов', '2026-05-22 17:53:39'),
(295, 1, 'Подписание документа ЭЦП: Отправка', '2026-05-22 17:53:45'),
(296, 1, 'Просмотр списка документов', '2026-05-22 17:53:47'),
(297, 1, 'Проверка ЭЦП документа: Отправка', '2026-05-22 17:53:48'),
(298, 1, 'Проверка ЭЦП документа: Отправка', '2026-05-22 17:53:55'),
(299, 1, 'Просмотр списка документов', '2026-05-22 17:54:56'),
(300, 1, 'Просмотр документа с ЭЦП: Отправка', '2026-05-22 17:54:57'),
(301, 1, 'Проверка ЭЦП документа: Отправка', '2026-05-22 17:55:13'),
(302, 1, 'Просмотр документа с ЭЦП: Отправка', '2026-05-22 17:55:14'),
(303, 1, 'Создание исправления к документу: Отправка', '2026-05-22 17:55:27'),
(304, 1, 'Просмотр списка документов', '2026-05-22 17:55:30'),
(305, 9, 'Вход в систему', '2026-05-22 17:56:12'),
(306, 9, 'Просмотр списка документов', '2026-05-22 17:56:12'),
(307, 9, 'Проверка ЭЦП документа: Отправка', '2026-05-22 17:56:27'),
(308, 9, 'Просмотр документа с ЭЦП: Отправка', '2026-05-22 17:56:29'),
(309, 9, 'Подписание документа ЭЦП: Исправление к документу: Отправка', '2026-05-22 17:56:41'),
(310, 9, 'Просмотр списка документов', '2026-05-22 17:56:43'),
(311, 9, 'Просмотр списка документов', '2026-05-22 17:56:47'),
(312, 9, 'Просмотр документа с ЭЦП: Исправление к документу: Отправка', '2026-05-22 17:58:20'),
(313, 9, 'Просмотр списка документов', '2026-05-22 17:59:23'),
(314, 9, 'Просмотр списка документов', '2026-05-22 18:07:26'),
(315, 1, 'Вход в систему', '2026-05-22 18:08:12'),
(316, 1, 'Просмотр списка документов', '2026-05-22 18:08:12'),
(317, 1, 'Просмотр документа с ЭЦП: Исправление к документу: Отправка', '2026-05-22 18:08:20'),
(318, 1, 'Просмотр списка документов', '2026-05-22 18:08:38'),
(319, 1, 'Просмотр документа с ЭЦП: Исправление к документу: Отправка', '2026-05-22 18:09:18'),
(320, 1, 'Вход в систему', '2026-05-23 09:13:46'),
(321, 1, 'Просмотр списка документов', '2026-05-23 09:13:46'),
(322, 1, 'Загрузка и шифрование документа: Тест_документ', '2026-05-23 09:17:16'),
(323, 1, 'Просмотр списка документов', '2026-05-23 09:17:25'),
(324, 1, 'Просмотр списка документов', '2026-05-23 09:18:01'),
(325, 1, 'Просмотр списка документов', '2026-05-23 09:18:31'),
(326, 1, 'Просмотр документа с ЭЦП: Исправление к документу: Отправка', '2026-05-23 09:18:35'),
(327, 9, 'Вход в систему', '2026-05-23 09:23:33'),
(328, 9, 'Просмотр списка документов', '2026-05-23 09:23:33'),
(329, 9, 'Просмотр списка документов', '2026-05-23 09:32:11'),
(330, 9, 'Просмотр списка документов', '2026-05-23 09:32:16'),
(331, 9, 'Просмотр списка документов', '2026-05-23 09:32:16'),
(332, 9, 'Просмотр списка документов', '2026-05-23 09:32:17'),
(333, 9, 'Вход в систему', '2026-05-23 09:32:43'),
(334, 9, 'Просмотр списка документов', '2026-05-23 09:32:43'),
(335, 9, 'Просмотр списка документов', '2026-05-23 09:38:02'),
(336, 9, 'Просмотр списка документов', '2026-05-23 09:38:03'),
(337, 9, 'Загрузка и шифрование документа: 123', '2026-05-23 09:38:39'),
(338, 9, 'Просмотр списка документов', '2026-05-23 09:38:41'),
(339, 1, 'Вход в систему', '2026-05-23 09:38:46'),
(340, 1, 'Просмотр списка документов', '2026-05-23 09:38:46'),
(341, 9, 'Вход в систему', '2026-05-23 09:38:56'),
(342, 9, 'Просмотр списка документов', '2026-05-23 09:38:57');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('admin','employee') DEFAULT 'employee',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `full_name`, `email`, `password`, `role`, `created_at`) VALUES
(1, 'Администратор', 'admin@mail.ru', '$2b$10$VLa/Rsa1WRPyUXyJC17e6uCqKno75YGGkJ15.Sb36MrBRfqp5O.Wi', 'admin', '2026-05-19 12:05:57'),
(2, 'Сотрудник', 'employee@mail.ru', '$2b$10$g6IZZm3QC2q2oNQeYbhKFucP9QZnEnrrloMtnI9fo0EMTcDmkcd06', 'employee', '2026-05-19 13:46:25'),
(6, 'Иванов Иван Иванович', 'ivanov@mail.ru', '$2b$10$V/aGmaPR.1kLpTF8.MNVouxKjJV8d6NwbtoKz4R3QK4TLiWKynuIG', 'employee', '2026-05-19 15:37:51'),
(7, 'Петрова Анна Сергеевна', 'petrova@mail.ru', '$2b$10$GclAvD9sUYlDSCybZbUrcOPMx0XDx6Ec.XvO9yb7yZrDtSNGlKJW.', 'employee', '2026-05-19 15:38:15'),
(8, 'Сидоров Алексей Петрович', 'sidorov@mail.ru', '$2b$10$2FE3xpvHo8mxwcowdtkgIexZX72MGQ4TSyobmM83neh7M3AQKGrXu', 'employee', '2026-05-19 15:38:33'),
(9, 'Останина Полина Сергеевна', 'polina2000@gmail.com', '$2b$10$51Xv5xlptwrgTC1ssk7nre//dUl0eCZftTN5/1v9g5LwTWV7pVR0W', 'employee', '2026-05-19 15:53:01'),
(10, 'Иванов Максим Сергеевич', 'admin1@mail.ru', '$2b$10$HWmlnQV6IJtSQNdbh5uo8eiVvYUhGvih0QQJItZkq8q0ZUyBry43u', 'admin', '2026-05-19 17:32:01');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `documents`
--
ALTER TABLE `documents`
  ADD PRIMARY KEY (`id`),
  ADD KEY `uploaded_by` (`uploaded_by`),
  ADD KEY `signed_by` (`signed_by`),
  ADD KEY `fk_documents_receiver` (`receiver_id`);

--
-- Индексы таблицы `document_recipients`
--
ALTER TABLE `document_recipients`
  ADD PRIMARY KEY (`id`),
  ADD KEY `document_id` (`document_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `logs`
--
ALTER TABLE `logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `email` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `documents`
--
ALTER TABLE `documents`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `document_recipients`
--
ALTER TABLE `document_recipients`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT для таблицы `logs`
--
ALTER TABLE `logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=343;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `documents`
--
ALTER TABLE `documents`
  ADD CONSTRAINT `documents_ibfk_1` FOREIGN KEY (`uploaded_by`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `documents_ibfk_2` FOREIGN KEY (`signed_by`) REFERENCES `users` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `fk_documents_receiver` FOREIGN KEY (`receiver_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `document_recipients`
--
ALTER TABLE `document_recipients`
  ADD CONSTRAINT `document_recipients_ibfk_1` FOREIGN KEY (`document_id`) REFERENCES `documents` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `document_recipients_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `logs`
--
ALTER TABLE `logs`
  ADD CONSTRAINT `logs_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
